{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 4, "activity_regularizer": null, "trainable": true, "init": "normal", "bias": true, "input_dtype": "float32", "input_dim": 4, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "batch_input_shape": [null, 4]}}, {"class_name": "Highway", "config": {"W_constraint": null, "b_constraint": null, "name": "highway_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.05, "trainable": true, "name": "dropout_1"}}, {"class_name": "MaxoutDense", "config": {"W_constraint": null, "b_constraint": null, "name": "maxoutdense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 4, "nb_feature": 4}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "normal", "bias": true, "input_dim": 4, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 3}}]}